run/chicago_turb/0/include/fixedInlet
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

inlet
{
    type  turbulentInlet;
    referenceField  uniform (10 0 0);
    fluctuationScale (0.05 0.05 0.05);
    value $internalField;
}

// ************************************************************************* //
