run/chicago_turb/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
12864
(
850
-7.02071e-06
-9.18097e-05
850
-6.17793e-06
-9.67117e-05
850
-5.12924e-06
...
)
;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform -850;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
849.999
849.999
849.999
849.999
849.999
849.999
849.999
849.999
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
